tap "anomalyco/tap"
tap "tw93/tap"

# ──────────────────────────────────────────────
# Shared (all platforms)
# ──────────────────────────────────────────────
brew "fzf"
brew "gh"
brew "helix"
brew "jq"
brew "lsd"
brew "ruff"
brew "starship"
brew "uv"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "herdr"


# ──────────────────────────────────────────────
# macOS only
# ──────────────────────────────────────────────
if OS == "Darwin"
  brew "mole"
  brew "python@3.14"
  brew "pipx"
  brew "portaudio"
  brew "anomalyco/tap/opencode"

  cask "iina"
  cask "tw93/tap/kakuku"
  cask "maccy"
end

# ──────────────────────────────────────────────
# Linux only
# ──────────────────────────────────────────────
if OS == "Linux"
  # Add Linux-only packages here
end
